// Задание к уроку 2.2

// Создайте переменную isMorning со значением true. Поместите переменную в условие оператора if.
// В теле оператора выполните код console.log("Пора вставать"); Сообщение должно быть выведено в консоль.
// А теперь измените значение isMorning на false и посмотрите что будет.

// Задание к уроку 2.3

// Добавьте в предыдущий код оператор else. В теле оператора выполните код console.log("Еще можно спать");

// Задание к уроку 2.4

// У нас есть 9 этажное здание. Наш офис находится на 7м этаже.
// Напишите программу, используя if и операторы сравнения, которая говорит, если лифт на 7 этаже,
// это наш этаж и нам пора выходить.

// Задание к уроку 2.5

// Напишите программу, используя if..else и условные операторы. Суть такова: если вы сдали экзамен и вам уже
// исполнилось 18 – вы получаете водительское удостоверение, иначе катайтесь на велосипеде

// Задание к уроку 2.6

// Нашишите программу, которая гласит: если у меня в корзине 0 яблок, значит я голоден. Иначе – я сыт.
// Нашишите программу, которая принимает переменную answer типа string, и гласит: если есть ответ, я получил работу
// иначе – ожидаю ответ.

// Задание к уроку 2.7

let tool = '';

// Используйте короткую запись сравнения, присвойте в переменную myTool
// значение переменной tool, иначе 'pen'
let myTool;

console.log(`My tool is ${myTool}.`);

// Перепишите значение переменной tool на 'marker', и посмотрите на результат снова.

// Задание к уроку 2.8
// Приведите все выражения ниже к тернарному оператору

let isLocked = false;

if (isLocked) {
    console.log('Тебе нужен ключ.');
} else {
    console.log('Ключ не требуется.');
}

let isCorrect = true;

if (isCorrect) {
    console.log('Правильно!');
} else {
    console.log('Неправильно!');
}

let myMoto = 'Share your knowledge!';

if (myMoto === 'Share your knowledge!') {
    console.log('I teach on Smartians!');
} else {
    console.log("I study on Smartians!");
}

// Задание к уроку 2.9
// Создай переменную today и присвойте ей значение сегодняшнего дня недели.
// Затем с помощью else if сделайте вывод в консоль, какой сегодня день недели.

// Задание к уроку 2.10
// Выполните задание 2.9 еще раз, используя Switch
